# 目录

# 第一幕 空间的本质

# 第1章 欧几里得几何与非欧几何 2

1.1 欧几里得几何与双曲几何 2

1.2 球面几何 5

1.3 球面三角形的角盘 8

1.4 曲面的内蕴几何与外在几何 9

1.5 通过"直性"来构作测地线 12

1.6 空间的本质 15

# 第2章 高斯曲率 18

2.1 引言 18

2.2 圆的周长和面积 20

2.3 局部高斯- 博内定理 24

# 第3章 序幕和第一幕的习题 26

# 第二幕 度量

# 第4章 曲面映射:度量 34

4.1 引言 34

4.2 球面的投影地图 36

4.3 一般曲面上的度量 38

4.4 度量曲率公式 41

4.5 共形地图 43

4.6 讲一点儿可视化的复分析 45

4.7 球面的共形球极地图 49

4.8 球极平面投影公式 53

4.9 球极平面投影的保圆性 55

# 第5章 伪球面和双曲平面 57

5.1 贝尔特拉米的洞察 57

5.2 曳物线和伪球面 58

5.3 伪球面的共形地图 61

5.4 贝尔特拉米- 庞加莱半平面 62

5.5 利用光学来求测地线 65

5.6 平行角 68

5.7 贝尔特拉米- 庞加莱圆盘 71

# 第6章 等距变换和复数 74

6.1 引言 74

6.2 默比乌斯变换 76

6.3 主要结果 82

6.4 爱因斯坦的时空几何学 84

6.5 三维双曲几何 90

# 第7章 第二幕的习题 96

# 第三幕 曲率

# 第8章 平面曲线的曲率 110

8.1 引言 110

8.2 曲率圆 112

8.3 牛顿的曲率公式 113

8.4 作为转向率的曲率 115

8.5 例子:牛顿的曳物线 119

# 第9章 三维空间中的曲线 121

# 第10章 曲面的主曲率 124

10.1 欧拉的曲率公式 124

10.2 欧拉的曲率公式的证明 126

10.3 旋转曲面 127

# 第11章 测地线和测地曲率 131

11.1 测地曲率和法曲率 131

11.2 默尼耶定理 133

11.3 测地线是"直的" 135

11.4 测地曲率的内蕴量度 136

11.5 量度测地曲率的一个简单的外在方法 136

11.6 用透明胶带构作测地线的一个新解释 137

11.7 旋转曲面上的测地线 138

11.7.1 球面上的克莱罗定理·138

11.7.2 开普勒第二定律·140

11.7.3 牛顿对开普勒第二定律的几何证明·142

11.7.4 克莱罗定理的动力学证明·144

11.7.5 应用:再看双曲平面上的测地线·146

# 第12章 曲面的外在曲率·149

12.1 引言 ·149

12.2 球面映射·149

12.3 曲面的外在曲率·151

12.4 哪些形状是可能的?·154

# 第13章高斯的绝妙定理·159

13.1 引言·159

13.2 高斯的漂亮定理(1816年)·159

13.3 高斯的绝妙定理(1827年)·161

# 第14章 尖刺的曲率·165

14.1 引言·165

14.2 锥形尖刺的曲率·165

14.3 多面角的内蕴曲率与外在曲率·168

14.4多面体的绝妙定理·170

# 第15章 形状导数·172

15.1 方向导数·172

15.2 形状导数S·175

15.3 S的几何效应·176

15.4 绕道线性代数:奇异值分解和转置运算的几何学·177

15.5 S的一般矩阵·182

15.6 S的几何解释和[S]的化简·184

15.7 [S]由三个曲率完全确定·186

15.8 渐近方向·187

15.9 经典术语和记号:三种基本形式·189

# 第16章 全局高斯-博内定理,引论·191

16.1 一些拓扑学知识与结果的陈述·191

16.2 球面和环面的曲率·194

16.2.1 球面的全曲率·194

16.2.2 环面的全曲率·196

16.3 看一看厚煎饼的  $\kappa (S_{g})$  197

16.4 看一看面包圈和桥的  $\kappa (S_{g})$  198

16.5 拓扑度和球面映射·200

16.6 历史注释·202

# 第17章 全局高斯-博内定理的第一个证明(启发性证明)··203

17.1 平面环路的全曲率:霍普夫旋转定理·203

17.2 变形圆周的全曲率·206

17.3 霍普夫旋转定理的启发性证明·208

17.4 变形球面的全曲率·209

17.5 全局高斯-博内定理的启发性证明·210

# 第18章 全局高斯-博内定理的第二个证明(利用角盈)·213

18.1 欧拉示性数·213

18.2 欧拉的(经验的)多面体公式·213

18.3 柯西对欧拉多面体公式的证明·216

18.3.1 摊平了的多面体·216

18.3.2 多边形网的欧拉示性数·217

18.4 勒让德对欧拉多面体公式的证明·219

18.5 对曲面增加柄以提高其亏格·222

18.6 全局高斯-博内定理的角盈证明·225

# 第19章 全局高斯一博内定理的第三个证明（利用向量场） 227

19.1 引言 227

19.2 平面上的向量场 227

19.3 奇点的指数 228

19.4 原型奇点：复幂函数 231

19.5 曲面上的向量场 234

19.5.1 增量流向量场 234

19.5.2 增量流与地形图的关系 236

19.5.3 怎样在曲面上定义奇点指数 238

19.6 庞加莱-霍普夫定理 239

19.6.1 例子：拓扑球面 239

19.6.2 庞加莱-霍普夫定理的证明 241

19.6.3 应用：欧拉-吕以利埃公式的证明 243

19.6.4 庞加莱的微分方程与霍普夫的线场的比较·244

19.7 全局高斯-博内定理的向量场证明 249

19.8 往前的路怎么走？ 253

# 第20章 第三幕的习题 255

# 第四幕 平行移动

# 第21章 一个历史谜团 268

# 第22章 外在的构作 270

22.1 一边前进，一边向曲面投影·270

22.2 测地线和平行移动 273

22.3 马铃薯削皮器的移动 274

# 第23章 内蕴的构作 278

23.1 沿测地线的平行移动 278

23.2 内蕴（即“协变"）导数·279

# 第24章 和乐性 283

24.1 例子：球面 283

24.2 一般的测地线三角形的和乐性 28524.3和乐性是可加的 28624.4例子：双曲平面 287

# 第25章绝妙定理的一个直观几何证明 291

25.1 引言 291

25.2 关于记号和定义的一些说明·292

25.3 至今所知的故事 293

25.4 球面映射保持平行移动不变·294

25.5 再说漂亮定理和绝妙定理·295

# 第26章 全局高斯一博内定理的第四个证明（利用和乐性） 297

26.1 引言 297

26.2 沿一条开曲线的和乐性？ 297

26.3 霍普夫对全局高斯-博内定理的内蕴证明 299

# 第27章 度量曲率公式的几何证明 301

27.1 引言 301

27.2 向量场围绕回路的环流量·303

27.3 排练：平面上的和乐性·304

27.4 和乐性作为地图中由度量定义的向量场的环流量·306

27.5 度量曲率公式的几何证明·309

# 第28章 曲率是相邻测地线之间的作用力 310

28.1 雅可比方程简介 310

28.1.1 零曲率：平面· 310

28.1.2 正曲率：球面· 312

28.1.3 负曲率：伪球面· 314

28.2 雅可比方程的两个证明 315

28.2.1 测地极坐标 315

28.2.2 相对加速度  $=$  速度的和乐性 318

28.3 小测地圆的周长和面积 320

# 第29章 黎曼曲率 322

29.1 引言和概要 322

29.2 n流形上的角盈 323

29.3 平行移动:三种构作方法·.325

29.3.1 定商柱上的最近向量·325

29.3.2 在平行移动平面内的定角 326

29.3.3 希尔德的梯子 327

29.4 内蕴(又称"协变")导数V 327

29.5 黎曼曲率张量 329

29.5.1 统一个小"平行四边形"的平行移动·.329

29.5.2 用向量换位子把这个"平行四边形"封闭起来 331

29.5.3 黎曼曲率的一般公式·332

29.5.4 黎曼曲率是一个张量·334

29.5.4 黎曼曲率是一个张量·334

29.5.5 黎曼张量的分量·336

29.5.6 对于固定的  $w_{\circ}$  向量的和乐性只依赖于回路所在的平面及其所围面积·.337

29.5.7 黎曼张量的对称性·338

29.5.8 截面曲率 340

29.5.9 关于黎曼张量起源的历史注记 341

29.6  $n$  维流形的雅可比方程·.343

29.6.1 截面雅可比方程的几何证明 343

29.6.2 截面雅可比方程的几何意义 345

29.6.3 雅可比方程和截面雅可比方程的计算证明 346

29.7 里奇张量 347

29.7.1 由一束测地线包围的面积的加速度·.347

29.7.2 里奇张量的定义和几何意义 349

29.8 终曲 351

# 第30章 爱因斯坦的弯曲时空 352

30.1 引言:我一生中最快乐的想法 352

30.2 引力的测汐力 354

30.3 牛顿引力定律的几何形式·358

30.4 时空的度量 360

30.5 时空的图示 362

30.6 爱因斯坦的真空场方程的几何形式 363

30.7 施瓦氏解和爱因斯坦理论的最初验证 366

30.8 引力波 371

30.9 爱因斯坦的(有物质的)场方程的几何形式 374

30.10 引力坍缩成为黑洞 377

30.11 宇宙学常数:"我一生中最严重的错误 381

30.12 结束语 383

# 第31章 第四幕的习题 384

# 第五幕形式

# 第32章 1-形式 394

32.1 引言 394

32.2 1-形式的定义 395

32.3 1-形式的例子 397

32.3.1 引力做功的1- 形式·397

32.3.2 引力做功1- 形式的可视化 398

32.3.3 等高线图和梯度 1- 形式 399

32.3.4 行向量 402

32.3.5 狄拉克符号(左矢)·402

32.4 基底 1-形式 403

32.5 1-形式的分量 404

32.6 梯度 df 是 1-形式 405

32.6.1 复习:梯度  $\nabla f$ 是一个向量 405

32.6.2 梯度 df 是一个1- 形式 406

32.6.3 1-形式的笛卡儿基  $\{\mathbf{d}x^{j}\}$  407

32.6.4  $\mathbf{d}f = (\partial_{x}f)\mathbf{d}x+$$(\partial_{y}f)\mathrm{d}y$  的 1- 形式解释 408

32.7 1-形式加法的几何解释 408

# 第 33 章 张量 411

33.1 张量的定义:阶 411

33.2 例子:线性代数 412

33.3 从原有的张量做出新张量 412

33.3.1 加法 412

33.3.2 乘法:张量积 413

33.4 分量 413

33.5 度量张量与经典线元的关系 414

33.6 例子:再看线性代数 415

33.7 缩并 416

33.8 用度量张量来改变张量的阶 417

33.9 对称张量和反对称张量 419

# 第 34 章 2- 形式 421

34.1 2- 形式和  $p$ - 形式的定义 421

34.2 例子:面积 2- 形式 422

34.3 两个 1- 形式的楔积 423

34.4 极坐标下的面积 2- 形式 426

34.5 基底 2- 形式及投影 427

34.6 2- 形式与  $\mathbb{R}^{3}$  中向量的联系:流量 429

34.7  $\mathbb{R}^{3}$  中向量积与楔积的关系 431

34.8 法拉第的电磁 2- 形式与麦克斯韦的电磁 2- 形式 433

# 第 35 章 3- 形式 439

35.1 3- 形式需要三个维度 439

35.2 一个 2- 形式与一个 1- 形式的楔积 439

35.3 体积 3- 形式 440

35.4 球极坐标中的 3- 形式 441

35.5 三个 1- 形式的楔积,  $p$  个 1- 形式的楔积 442

35.6 基底 3- 形式 444

35.7  $\Psi \wedge \Psi \neq 0$  可能吗? 445

# 第 36 章 微分学 446

36.1 1- 形式的外导数 446

36.2 2- 形式和  $p$ - 形式的外导数 448

36.3 形式的莱布尼茨法则 449

36.4 闭形式和恰当形式 450

36.4.1 基本结果:  $\mathbf{d}^{2} = 0$  450

36.4.2 闭形式和恰当形式 450

36.4.3 复分析:柯西-黎曼方程 451

36.5 用形式做向量运算 452

36.6 麦克斯韦方程组 456

# 第 37 章 积分学 459

37.1 1- 形式的线积分 459

37.1.1 环流和功 459

37.1.2 与路径的无关性  $\Longleftrightarrow$ 闭合环路积分为零 460

37.1.3 恰当形式  $\phi = \mathbf{d}f$  的积分 461

37.2 外导数是一个积分 461

37.2.1 1- 形式的外导数 461

37.2.2 2- 形式的外导数 465

37.3 外微积分基本定理 (广义斯托克斯定理) 467

37.3.1 外微积分基本定理 467

37.3.2 相伴的历史问题 467

37.3.3 例子:面积 468

37.4 边界的边界是零 468

37.5 向量微积分的经典积分定理···469

37.5.1  $\Phi = 0$  形式···469

37.5.2  $\Phi = 1$  形式···470

37.5.3  $\Phi = 2$  形式···471

37.6 外微积分基本定理的证明···471

37.7 柯西定理···474

37.8 1- 形式的庞加莱引理···474

37.9 德拉姆上同调初步···475

37.9.1 行言···475

37.9.2 一个特殊的二维涡旋向量场···476

37.9.3 涡旋1- 形式是用的···477

37.9.4 涡旋1- 形式的几何意义···477

37.9.5 闭1- 形式的环流的拓扑稳定性···478

37.9.6 第一德拉姆上同调群···480

37.9.7  $\mathbb{R}^{3}$  中的平方反比点源···482

37.9.8 第二德拉姆上同调群···483

37.9.9 环面的第一德拉姆上同调群···485

# 第38章 用形式来讲微分几何···488

38.1 引言:嘉当的活动标架法···488

38.2 联络1- 形式···490

38.2.1 关于符号的约定和两个定义···490

38.2.2 联络1- 形式···491

38.2.3 注意:以前习惯的记号···493

38.3 姿态矩阵···494

38.3.1 通过姿态矩阵来讲连络形式···494

38.3.2 例子:柱面标架场···495

38.4 嘉当的两个结构方程···498

38.4.1 用  $e_{j}$  的对偶  $\mathbf{d}x^{j}$  来表示  $m_{i}$  的对偶  $\pmb{\theta}^{i}$  498

38.4.2 嘉当第一结构方程···498

38.4.3 嘉当第二结构方程···499

38.4.4 例子:球面标架场···500

38.5 曲面图6个基本形式方程···505

38.5.1 使嘉当的活动标架适用于曲面:形状导数与外在曲率···505

38.5.2 例子:球面···507

38.5.3 基底分解的唯一性···508

38.5.4 曲面的6个基本形式方程···509

38.6 对称性方程和彼得松- 梅纳第- 科达齐方程的几何意义···510

38.7 高斯方程的几何形式···511

38.8 度量曲率公式和绝妙定理的证明···512

38.8.1 引理:  $\omega_{12}$  的唯一性···512

38.8.2 度量曲率公式的证明···512

38.9 一个新的公式···514

38.10 希尔伯特引理···514

38.11 利布曼的刚性球面定理···515

38.12  $n$  流形的曲率2- 形式···517

38.12.1 引言和概述···517

38.12.2 广义外导数···519

38.12.3 由曲率2- 形式导出黎曼张量···520

38.12.4 再论比安基恒等式···521

38.13 施瓦西黑洞的曲率···522

第39章 第五幕的习题···528

人名索引···541

术语索引···546

补充阅读(图灵社区下载)

参考文献(图灵社区下载)